src/main/resources/mockdata/1ab7ef6a-d1d4-4a4f-90a2-882aed18af14.json

{
  "purchase_order": {
    "id": "1ab7ef6a-d1d4-4a4f-90a2-882aed18af14",
    "po_number": "268758",
    "created": "2018-06-29T03:00:00.000+0000",
    "comments": "",
    "total_items": 3,
    "total_estimated_price": 127.94,
    "adjustments": "",
    "assigned_to": "Ann",
    "created_by": "mu44",
    "transmission_date": "",
    "transmission_method": "",
    "po_workflow_status_id": "Open",
    "po_receipt_status": "not received",
    "po_payment_status": ""
  },
  "po_lines": [
    {
      "id": "07c5d04e-cabe-11e8-a8d5-f2801f1b9fd1",
      "acquisition_method": "Email to vendor",
      "barcode": "",
      "cancellation_restriction": false,
      "cancellation_restriction_comment": "",
      "receipt_date": null,
      "collection": false,
      "owner": "LTS Acquisitions",
      "po_line_number": "268758-01",
      "po_line_description": "",
      "adjustment": {
        "id": "07c5d530-cabe-11e8-a8d5-f2801f1b9fd1",
        "shipment": 0,
        "insurance": 0,
        "discount": 0,
        "overhead": 0,
        "credit": 0,
        "tax_1": 0,
        "tax_2": 0,
        "invoice_id": null,
        "use_pro_rate": false
      },
      "alerts": [
        {
          "id": "07c5d3e6-cabe-11e8-a8d5-f2801f1b9fd1",
          "alert": ""
        }
      ],
      "claims": [
        {
          "id": "07c5d666-cabe-11e8-a8d5-f2801f1b9fd1",
          "claim": true,
          "sent": "",
          "grace": null,
          "po_line_id": null
        }
      ],
      "cost": {
        "id": "07c5d792-cabe-11e8-a8d5-f2801f1b9fd1",
        "list_price": 68.00,
        "currency": "USD",
        "quantity": 1,
        "estimated_price": 68.00
      },
      "details": {
        "id": "07c5d792-cabe-11e9-a8d5-f2801f1b9fd1",
        "title": "Taxes, tributes and tributary lands in the making of Scandinavian kingdoms in the Middle Ages / Steinar Imsen (ed.).",
        "receiving_note": "",
        "product_id": "10407849",
        "subscription_from": null,
        "material_type": "book",
        "subscription_interval": 0,
        "subscription_to": null,
        "description": ""
      },
      "eresource": {
        "id": "07c5d8be-cabe-11e8-a8d5-f2801f1b9fd1",
        "activation_status": "",
        "activation_due": 0,
        "create_inventory": false,
        "trial": false,
        "expected_activation": null,
        "user_limit": 0,
        "material_id": null,
        "access_provider": null
      },
      "license": {
        "id": "07c5d8be-cabe-11e8-a8d5-f2801f1b9fd1",
        "code": "",
        "description": "",
        "reference": ""
      },
      "location": {
        "id": "07c5d9ea-cabe-11e8-a8d5-f2801f1b9fd1",
        "quantity": 1,
        "location_id": "Icelandic"
      },
      "order_format": {
        "id": "07c5dd6e-cabe-11e8-a8d5-f2801f1b9fd1",
        "code": null,
        "description": "Physical"
      },
      "order_type": {
        "id": "07c5dec2-cabe-11e8-a8d5-f2801f1b9fd1",
        "code": null,
        "description": "One-time"
      },
      "physical": {
        "id": "07c5dff8-cabe-11e8-a8d5-f2801f1b9fd1",
        "expected_receipt_date": null,
        "receipt_due": null,
        "expected_receipt_interval": 0,
        "volumes": 1,
        "material_id": "",
        "material_supplier": null
      },
      "purchase_order_id": "",
      "receipt_status": {
        "id": "07c5e124-cabe-11e8-a8d5-f2801f1b9fd1",
        "code": null,
        "description": "Not Received"
      },
      "renewal": {
        "id": null,
        "cycle": "",
        "review_period": 0,
        "renewal_date": null,
        "interval": 0,
        "manual_renewal": true
      },
      "source": {
        "id": "07c5e250-cabe-11e8-a8d5-f2801f1b9fd1",
        "code": null,
        "description": "manual"
      },
      "vendor": {
        "id": "Amazon.com",
        "ref_number": "",
        "ref_no_type": "",
        "instructions": null,
        "vendor_account": "",
        "note_from_vendor": ""
      },
      "workflow_status": {
        "id": "07c5e372-cabe-11e8-a8d5-f2801f1b9fd1",
        "code": null,
        "description": "Approved"
      },
      "selector": "Stevens",
      "requester": "",
      "account_number": "",
      "donor": ""
    },
    {
      "id": "156503d2-cacd-11e8-a8d5-f2801f1b9fd1",
      "acquisition_method": "Email to vendor",
      "barcode": "",
      "cancellation_restriction": false,
      "cancellation_restriction_comment": "",
      "receipt_date": null,
      "collection": false,
      "owner": "LTS Acquisitions",
      "po_line_number": "268758-02",
      "po_line_description": "",
      "adjustment": {
        "id": "07c5d530-cabe-11e8-a8d5-f2801f1b9fd1",
        "shipment": 0,
        "insurance": 0,
        "discount": 0,
        "overhead": 0,
        "credit": 0,
        "tax_1": 0,
        "tax_2": 0,
        "invoice_id": null,
        "use_pro_rate": false
      },
      "alerts": [
        {
          "id": "15650508-cacd-11e8-a8d5-f2801f1b9fd1",
          "alert": ""
        }
      ],
      "claims": [
        {
          "id": "15650634-cacd-11e8-a8d5-f2801f1b9fd1",
          "claim": true,
          "sent": "",
          "grace": null,
          "po_line_id": null
        }
      ],
      "cost": {
        "id": "15650a08-cacd-11e8-a8d5-f2801f1b9fd1",
        "list_price": 34.95,
        "currency": "USD",
        "quantity": 1,
        "estimated_price": 34.95
      },
      "details": {
        "id": "15650b70-cacd-11e8-a8d5-f2801f1b9fd1",
        "title": "Alabama Women: Their Lives and Times",
        "receiving_note": "",
        "product_id": "9780820350790",
        "subscription_from": null,
        "material_type": "book",
        "subscription_interval": 0,
        "subscription_to": null,
        "description": ""
      },
      "eresource": {
        "id": "15650f62-cacd-11e8-a8d5-f2801f1b9fd1",
        "activation_status": "",
        "activation_due": 0,
        "create_inventory": false,
        "trial": false,
        "expected_activation": null,
        "user_limit": 0,
        "material_id": null,
        "access_provider": null
      },
      "license": {
        "id": "156510b6-cacd-11e8-a8d5-f2801f1b9fd1",
        "code": "",
        "description": "",
        "reference": ""
      },
      "location": {
        "id": "156511d8-cacd-11e8-a8d5-f2801f1b9fd1",
        "quantity": 1,
        "location_id": "Icelandic"
      },
      "order_format": {
        "id": "15651304-cacd-11e8-a8d5-f2801f1b9fd1",
        "code": null,
        "description": "Physical"
      },
      "order_type": {
        "id": "1565169c-cacd-11e8-a8d5-f2801f1b9fd1",
        "code": null,
        "description": "One-time"
      },
      "physical": {
        "id": "07c5dff8-cabe-11e8-a8d5-f2901f1b9fd1",
        "expected_receipt_date": null,
        "receipt_due": null,
        "expected_receipt_interval": 0,
        "volumes": 1,
        "material_id": "",
        "material_supplier": null
      },
      "purchase_order_id": "",
      "receipt_status": {
        "id": "156517f0-cacd-11e8-a8d5-f2801f1b9fd4",
        "code": null,
        "description": "Not Received"
      },
      "renewal": {
        "id": null,
        "cycle": "",
        "review_period": 0,
        "renewal_date": null,
        "interval": 0,
        "manual_renewal": true
      },
      "source": {
        "id": "1565191c-cacd-11e8-a8d5-f2801f1b9fd1",
        "code": null,
        "description": "manual"
      },
      "vendor": {
        "id": "Amazon.com",
        "ref_number": "",
        "ref_no_type": "",
        "instructions": null,
        "vendor_account": "",
        "note_from_vendor": ""
      },
      "workflow_status": {
        "id": "15651a3e-cacd-11e8-a8d5-f2801f1b9fd1",
        "code": null,
        "description": "Approved"
      },
      "selector": "Brown",
      "requester": "",
      "account_number": "",
      "donor": ""
    },
    {
      "id": "156503d2-cacd-11e8-a8d5-f2801d1b9fd1",
      "acquisition_method": "Email to vendor",
      "barcode": "",
      "cancellation_restriction": false,
      "cancellation_restriction_comment": "",
      "receipt_date": null,
      "collection": false,
      "owner": "LTS Acquisitions",
      "po_line_number": "268758-03",
      "po_line_description": "",
      "adjustment": {
        "id": "07c5d530-cabe-11e8-a8d5-f2801f1b9fdd",
        "shipment": 0,
        "insurance": 0,
        "discount": 0,
        "overhead": 0,
        "credit": 0,
        "tax_1": 0,
        "tax_2": 0,
        "invoice_id": null,
        "use_pro_rate": false
      },
      "alerts": [
        {
          "id": "15650508-cacd-11e8-d8d5-f2801f1b9fd1",
          "alert": ""
        }
      ],
      "claims": [
        {
          "id": "15650634-cacd-11e8-d8d5-f2801f1b9fd1",
          "claim": true,
          "sent": "",
          "grace": null,
          "po_line_id": null
        }
      ],
      "cost": {
        "id": "15650a08-cacd-11e8-d8d5-f2801f1b9fd1",
        "list_price": 24.99,
        "currency": "USD",
        "quantity": 1,
        "estimated_price": 24.99
      },
      "details": {
        "id": "15650b70-cacd-11e8-d8d5-f2801f1b9fd1",
        "title": "Kayak Fishing in the Northern Gulf Coast",
        "receiving_note": "",
        "product_id": "9780764354113",
        "subscription_from": null,
        "material_type": "book",
        "subscription_interval": 0,
        "subscription_to": null,
        "description": ""
      },
      "eresource": {
        "id": "15650f62-cacd-11e8-d8d5-f2801f1b9fd1",
        "activation_status": "",
        "activation_due": 0,
        "create_inventory": false,
        "trial": false,
        "expected_activation": null,
        "user_limit": 0,
        "material_id": null,
        "access_provider": null
      },
      "license": {
        "id": "156510b6-cacd-11e8-d8d5-f2801f1b9fd1",
        "code": "",
        "description": "",
        "reference": ""
      },
      "location": {
        "id": "156511d8-cacd-11e8-d8d5-f2801f1b9fd1",
        "quantity": 1,
        "location_id": "Icelandic"
      },
      "order_format": {
        "id": "15651304-cacd-11e8-d8d5-f2801f1b9fd1",
        "code": null,
        "description": "Physical"
      },
      "order_type": {
        "id": "1565169c-cacd-11e8-d8d5-f2801f1b9fd1",
        "code": null,
        "description": "One-time"
      },
      "physical": {
        "id": "07c5dff8-cabe-11e8-d8d5-f2901f1b9fd1",
        "expected_receipt_date": null,
        "receipt_due": null,
        "expected_receipt_interval": 0,
        "volumes": 1,
        "material_id": "",
        "material_supplier": null
      },
      "purchase_order_id": "",
      "receipt_status": {
        "id": "156517f0-cacd-11e8-d8d5-f2801f1b9fd4",
        "code": null,
        "description": "Not Received"
      },
      "renewal": {
        "id": null,
        "cycle": "",
        "review_period": 0,
        "renewal_date": null,
        "interval": 0,
        "manual_renewal": true
      },
      "source": {
        "id": "1565191c-cacd-11e8-d8d5-f2801f1b9fd1",
        "code": null,
        "description": "manual"
      },
      "vendor": {
        "id": "Amazon.com",
        "ref_number": "",
        "ref_no_type": "",
        "instructions": null,
        "vendor_account": "",
        "note_from_vendor": ""
      },
      "workflow_status": {
        "id": "15651a3e-cacd-11e8-d8d5-f2801f1b9fd1",
        "code": null,
        "description": "Approved"
      },
      "selector": "Brown",
      "requester": "",
      "account_number": "",
      "donor": ""
    }
  ]
}
